Revit 2026 API

# ConnectorManagerUnusedConnectors Property

---

Return all the unused Connectors of the Connector Manager.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectorSet UnusedConnectors { get; }
```
```vb
Public ReadOnly Property UnusedConnectors As ConnectorSet
	Get
```
```cpp
public:
property ConnectorSet^ UnusedConnectors {
	ConnectorSet^ get ();
}
```
```fsharp
member UnusedConnectors : ConnectorSet with get
```

#### Property Value

ConnectorSet

This property is used to retrieve the unused Connectors from the Connector Manager.

#### Reference

ConnectorManager Class

Autodesk.Revit.DB Namespace